[
    [
        {
            "content": "Sigmie application is focused to help developers using Elasticsearch as search engine. When it comes to using Elasticsearch as a search engine most of us are facing a lot of common problems. Beginning with the infrastructure, security, and data synchronization, until the relevance of the search results.",
            "hierarchy": [
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "Despite the fact Elasticsearch is free to use, it can become challenging to configure everything correctly. And that's exactly where our app can help you.",
            "hierarchy": [
                "# Common problems",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "Since Elasticsearch has no build in authentication one of the first\nthings that somebody installing Elasticsearch has to take care of\nauthentication. One common used method is using\nbasic authentication . Also good practice is to hide your server's public ip\naddress to the world in order to avoid any malicious attempts.",
            "hierarchy": [
                "# Security",
                "# Common problems",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "When using search-as-a-service provider you can comfortably send your\nuser's input directly from your frontend to your search. With\nElasticsearch you will need a controller in your application's\nbackend to validate the request data.",
            "hierarchy": [
                "# Searching",
                "# Common problems",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "The application's goal is to take over the pain of dealing with the above problems.",
            "hierarchy": [
                "# Solution",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "In less than 10 minutes you can have a secure and reliable Elasticsearch cluster. After you have\nbeen registered and you have created a project. You will choose the: Desired amount of nodes Cluster's location And we take care of: Creating the Elasticsearch nodes Putting a Loadbalancer in front of them Configuring basic authentication Hiding your Clusters public IP address",
            "hierarchy": [
                "# Creation",
                "# Solution",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "When your Cluster is up and running you can make use of the following access tokens. Admin Token Search-Only Token",
            "hierarchy": [
                "# Usage",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "You can make any request that you would normally send to your Elasticsearch by using the Admin Token. You will have set the  token in your requests  header and use our proxy URL address. Warning Keep in mind that there is monthly proxy request limit. It's preferred to use proxy requests for your search operations and not for data indexing.",
            "hierarchy": [
                "# Admin Token",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "Same like with the Admin Token you will have a search token available. Difference is that\nwith this token you will be allowed to make only search operation. Tip The purpose of this token is to allow you to query Elasticsearch directly from your frontend. Saving you the backend work.",
            "hierarchy": [
                "# Search-Only Token",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "If you discover a bug in Sigmie application, please open an issue on the Sigmie Application issues GitHub repository .",
            "hierarchy": [
                "# Bug Reports",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        },
        {
            "content": "If you discover a security vulnerability within the application, please send an email to security@sigmie.com. All security vulnerabilities will be promptly addressed.",
            "hierarchy": [
                "# Security Vulnerabilities",
                "# Application"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app"
        }
    ],
    [
        {
            "content": "Once your have a running Elasticsearch cluster in place, you can send send queries to it, by using\none of the provided access tokens and the  url as your Elasticsearch Host URL.",
            "hierarchy": [
                "# Proxy requests"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/proxy.html"
        },
        {
            "content": "When proxying a request you have to set the  header with token value . A CURL example to list your indices would be",
            "hierarchy": [
                "# Authentication",
                "# Proxy requests"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/proxy.html"
        },
        {
            "content": "By using the Admin token you can make all Elasticsearch operations, like when connection to Elasticsearch directly. With the Search token you can only send query request.",
            "hierarchy": [
                "# Token types",
                "# Proxy requests"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/proxy.html"
        }
    ],
    [
        {
            "content": "",
            "hierarchy": [
                "# Google Cloud"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/google.html"
        },
        {
            "content": "In order to authorize Sigmie Application to create Google Cloud Resources on your behalf,\nyou will need to generate a service account json file. Navigate to New Project  on your Google Cloud Console and create a project with a liked billing account. Active billing account Be sure that you have an active Billing Account linked. Otherwise you won't be able to create any resources. When your project is ready, visit the Service Accounts  page and click on + Create service account. On the Service account permissions page, select the Compute Admin role. Once you are done creating your Service Account, your will be navigated to the table overview of your Service Accounts. Right under the table's \"actions\"\ncolumn click on the the three dots, and select \"Create key\" in the dropdown menu. Select the recommended JSON key type and click \"Create\". Next copy the JSON file contents in the Google Service Account in the Project creation page. Service account permissions Since Sigmie manages many resources across Compute Engine, it's recommended to give the Compute Admin role to your service account.\nIf your don't wish to give too many permissions, can always pick the corresponding roles according to the Resources section.",
            "hierarchy": [
                "# Service Account",
                "# Google Cloud"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/google.html"
        },
        {
            "content": "",
            "hierarchy": [
                "#",
                "# Service Account",
                "# Google Cloud"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/google.html"
        },
        {
            "content": "When you create an Elasticsearch cluster using Sigmie on Google Cloud, the following resources will be created in your Google Cloud Project: VPC Network Subnet in your desired region Firewalls allowing internal connections for the following ports:\n9200 9300 Firewalls for the following external ports:\n443 22 Reserved external ip addresses for each requested node A VM Instance for each request node",
            "hierarchy": [
                "# Resources",
                "# Google Cloud"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/app\/google.html"
        }
    ],
    [
        {
            "content": "",
            "hierarchy": [
                "# Sigmie"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/sigmie"
        }
    ],
    [
        {
            "content": "Promises library is created for actions which have delays and therefore they need verification that they are successfully complete.",
            "hierarchy": [
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        },
        {
            "content": "You can install the Promises library via Composer .",
            "hierarchy": [
                "# Installation",
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        },
        {
            "content": "Let's say you want to create a new VM instance on your Cloud platform inside of your desired subnet but, if\nsomething goes wrong with the creation, you want to rollback the subnet creation. In the example above, we create a new subnet and then a new VM. If for some reason,\nthe subnet doesn't exist or the VM is not running, the  callback will be called. Tip The default delay between the verifications is 60 seconds and the default verification\nattempts are 3. You can change this values by extending the  class.",
            "hierarchy": [
                "# Basic usage",
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        },
        {
            "content": "You may create your custom promise classes and use them within a chain by extending\nthe . After your can use it in a chain like you would with the default  instance. Warning The promise actions should always return  or\n. Otherwise a  exception will be thrown.",
            "hierarchy": [
                "# Creating custom promises",
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        },
        {
            "content": "Any arguments passed to the  callback will we available the the next chain element within the  parameter. For example resolving a promise and passing the string  as the first argument tho\nthe  closure, Will make the  string available in the next chain element as the first value in the  array.",
            "hierarchy": [
                "# Passing values",
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        },
        {
            "content": "In case of a rejection a  is passed to the catch closure. If you reject a promise with a message like bellow: You will get a  exception as argument to your catch callback function.",
            "hierarchy": [
                "# Rejection",
                "# Promises"
            ],
            "type": "content",
            "url": "https:\/\/docs.sigmie.com\/promises.html"
        }
    ]
]